<template lang="pug">
  popup-modal-frame(name="privacy" title="プライバシーポリシー")
    .privacy-policy-modal
      p
        | ツンドク開発チーム（以下，「当方」といいます。）は，本ウェブサイト上で提供するサービス（以下,「本サービス」といいます。）における，ユーザーの個人情報の取扱いについて，以下のとおりプライバシーポリシー（以下，「本ポリシー」といいます。）を定めます。
      br
      h2 第１条 個人情報について
      p
        | 当サービスでは、以下の情報を保存しています。
      br
      p
        | ユーザーが、ソーシャルネットワークサービス等の外部サービスとの連携を許可した場合に、当該外部サービスでユーザーが利用するID及び、その他当該外部サービスのプライバシー設定によりユーザーが開示を認めた情報
      br
      h2 第2条（個人情報の収集方法）
      p
        | 当方は、サービスの運営にあたり、個人情報を取得することがあり、取得を行う際は、適正かつ公正な手段により行い、利用目的をあらかじめ公表するか、取得後速やかにご本人に通知または公表いたします。
      br
      h2 第3条（個人情報を収集・利用する目的）
      p
        | 当方が個人情報を収集・利用する目的は，以下のとおりです。
      br
      p
        | 当方サービスの提供・運営のため
        br
        | ユーザーにご自身の登録情報の閲覧や変更，削除，ご利用状況の閲覧を行っていただくため
        br
        |上記の利用目的に付随する目的
      br
      h2 第4条（個人情報の第三者提供）
      p 
        | 当方は，次に掲げる場合を除いて，あらかじめユーザーの同意を得ることなく，第三者に個人情報を提供することはありません。ただし，個人情報保護法その他の法令で認められる場合を除きます。
      br
      p
        |人の生命，身体または財産の保護のために必要がある場合であって，本人の同意を得ることが困難であるとき
        br
        |公衆衛生の向上または児童の健全な育成の推進のために特に必要がある場合であって，本人の同意を得ることが困難であるとき
        br
        |国の機関もしくは地方公共団体またはその委託を受けた者が法令の定める事務を遂行することに対して協力する必要がある場合であって，本人の同意を得ることにより当該事務の遂行に支障を及ぼすおそれがあるとき
        br
        |予め次の事項を告知あるいは公表し，かつ当方が個人情報保護委員会に届出をしたとき
        br
        |前項の定めにかかわらず，次に掲げる場合には，当該情報の提供先は第三者に該当しないものとします。
        br
        |当方が利用目的の達成に必要な範囲内において個人情報の取扱いの全部または一部を委託する場合
        br
        |合併その他の事由による事業の承継に伴って個人情報が提供される場合
        br
        |個人情報を特定の者との間で共同して利用する場合であって，その旨並びに共同して利用される個人情報の項目，共同して利用する者の範囲，利用する者の利用目的および当該個人情報の管理について責任を有する者の氏名または名称について，あらかじめ本人に通知し，または本人が容易に知り得る状態に置いた場合
      br
      h2 第5条（個人情報の開示）
      p 
        | 当方は，本人から個人情報の開示を求められたときは，本人に対し，遅滞なくこれを開示します。
      br
      h2 第6条（プライバシーポリシーの変更）
      p
        | 本ポリシーの内容は，法令その他本ポリシーに別段の定めのある事項を除いて，ユーザーに通知することなく，変更することができるものとします。
        br
        | 当方が別途定める場合を除いて，変更後のプライバシーポリシーは，本ウェブサイトに掲載したときから効力を生じるものとします。
      br
      h2 第7条（お問い合わせ窓口）
      p
        | 本ポリシーに関するお問い合わせは，下記の窓口までお願いいたします。
        br
        = "Eメールアドレス： tsundoku.dev@gmail.com"
</template>

<script lang="ts">
import { Vue, Component } from 'vue-property-decorator'

import Icon from '@/components/assets/Icon.vue'
import PopupModalFrame from '@/components/atoms/PopupModalFrame.vue'

@Component({ components: { Icon, PopupModalFrame } })
export default class PrivacyPolicyModal extends Vue {}
</script>

<style lang="sass" scoped>
.privacy-policy-modal
  padding:
    bottom: 16px

h2
  font:
    size: 16px
    weight: bold
</style>
